tomorrow/app/controllers/calendar_controller.rb

SELECT `events`.* FROM `events` WHERE (start_time >= '2010-01-01' AND start_time < '2020-01-02')
---
  def profile
    today = "2010-01-01"
    tomorrow = "2020-01-02"
    @events = Event.all