tomorrow/app/controllers/calendar_controller.rb

SELECT `events`.* FROM `events` WHERE (start_time >= '2010-01-01' AND start_time < '2020-01-02')
---
  def list_events
    @current_date = params["current_date"]
    today = "2010-01-01"
    tomorrow = "2020-01-02"


    # start getting today's events
    today_events = Event.where("end_date >= ?", @current_date)

SELECT `events`.* FROM `events` WHERE (start_time > '2010-01-03' OR end_time < :'2010-01-03')
---
  def filter_events
    st = params["start_time"]
    et = params["end_time"]
    cd = params["current_date"]

    @filtered_events = Event.where("end_date >= ?", cd)

INSERT INTO `events` (`on_months`, `title`, `on_days`, `start_time`, `end_date`, `popup_notif`, `end_time`, `start_date`, `description`, `privacy`, `repeat`, `all_day`, `location`, `email_notif`, `updated_at`, `created_at`, `calendar_id`, `on_years`) VALUES (NULL, 'Drinking with Julia', NULL, '2000-01-01 23:00:00', '2999-01-01 00:00:00', NULL, '2000-01-01 01:00:00', '2011-03-21', NULL, NULL, 0, NULL, NULL, NULL, '2011-03-22 02:58:30', '2011-03-22 02:58:30', 1, NULL)
---
  def add_event
    puts params
    tt = params['what']
    sd = params['current_date']
    rp = params['repeat']
    rp = false
    if not rp
      ed = DateTime.new(2999,1,1,0,0)
    end
    ed = DateTime.new(2999,1,1,0,0)

    st = params['add_start_time']
    et = params['add_end_time']

    #st = DateTime.new(sd.year, sd.month, sd.dat, st_h, st_m)

    st_h = st.to_f.floor
    st_m = (st.to_f - st_h) * 60
    st = "%d:%d" % [st_h, st_m]

    et_h = et.to_f.floor
    et_m = (et.to_f - et_h) * 60
    et = "%d:%d" % [et_h, et_m]

    ne = @user.events.create(:title=>tt,:start_time=>st,:end_time=>et,:calendar_id=>@calendar,:start_date=>sd, :end_date=>ed)