soka/app/controllers/events_controller.rb

  def index
    @events = Events.all
---
SELECT "events".* FROM "events"